gcoonrod/stm32-shift-display/firmware/src/main.cpp
void cmd_set_hour(SerialCommands *sender)
{
  char *hour_str = sender->Next();
  if (hour_str == NULL)
  {
    sender->GetSerial()->println("ERROR NO_HOUR");
    return;
  }

  int hour = atoi(hour_str);
  if (hour < 0 || hour >= 24)
  {
    sender->GetSerial()->printf("ERROR HOUR OUT OF RANGE {%d}: %s", hour, hour_str);
    return;
  }

  date_time_buf.hours = hour;
  rtc.setHours(hour);
}

void cmd_set_minute(SerialCommands *sender)
{
  char *m_str = sender->Next();
  if (m_str == NULL)
  {
    sender->GetSerial()->println("ERROR NO_MINUTE");
    return;
  }

  int m = atoi(m_str);
  if (m < 0 || m >= 60)
  {
    sender->GetSerial()->printf("ERROR MINUTE OUT OF RANGE {%d}: %s", m, m_str);
    return;
  }

  date_time_buf.minutes = m;
  rtc.setMinutes(m);
}

void cmd_set_second(SerialCommands *sender)
{
  char *second_str = sender->Next();
  if (second_str == NULL)
  {
    sender->GetSerial()->println("ERROR NO_SECOND");
    return;
  }

  int second = atoi(second_str);
  if (second < 0 || second >= 60)
  {
    sender->GetSerial()->printf("ERROR SECOND OUT OF RANGE {%d}: %s", second, second_str);
    return;
  }

  date_time_buf.seconds = second;
  rtc.setSeconds(second);
}

tm* unixTimestampToTime(const char *timestampStr) {
  // Convert the timestamp string to a time_t object
  time_t timestamp = atol(timestampStr); 

  timestamp += timezoneOffset * 60 * 60;

  // Use localtime to convert the timestamp to a tm struct
  return localtime(&timestamp); 
}

void cmd_set_time(SerialCommands *sender)
{
  char *timestampStr = sender->Next();
  if (timestampStr == NULL)
  {
    sender->GetSerial()->println("ERROR NO_TIMESTAMP");
    return;
  }

  tm *time = unixTimestampToTime(timestampStr);

  date_time_buf.hours = time->tm_hour;
  date_time_buf.minutes = time->tm_min;
  date_time_buf.seconds = time->tm_sec;
  date_time_buf.day = time->tm_mday;
  date_time_buf.month = time->tm_mon;
  date_time_buf.year = time->tm_year - 100;

  rtc.setHours(time->tm_hour);
  rtc.setMinutes(time->tm_min);
  rtc.setSeconds(time->tm_sec);
  rtc.setDay(time->tm_mday);
  rtc.setMonth(time->tm_mon);
  rtc.setYear(time->tm_year - 100);

  sender->GetSerial()->println("OK");
}

void cmd_get_time(SerialCommands *sender)
{

  // convert the date_time_buf to tm struct
  tm time = {0};
  time.tm_hour = date_time_buf.hours;
  time.tm_min = date_time_buf.minutes;
  time.tm_sec = date_time_buf.seconds;
  time.tm_mday = date_time_buf.day;
  time.tm_mon = date_time_buf.month;
  time.tm_year = date_time_buf.year + 100;

  // Apply the timezone offset to change the time to UTC
  time.tm_sec -= timezoneOffset * 60 * 60;

  time_t timestamp = mktime(&time);

  // Return the current time as a Unix timestamp
  sender->GetSerial()->println(timestamp);
}

void cmd_set_offset(SerialCommands *sender)
{
  char *offsetStr = sender->Next();
  if (offsetStr == NULL)
  {
    sender->GetSerial()->println("ERROR NO_OFFSET");
    return;
  }

  int offset = atoi(offsetStr);
  timezoneOffset = offset;
  sender->GetSerial()->println("OK");
}

void cmd_get_offset(SerialCommands *sender)
{
  sender->GetSerial()->println(timezoneOffset);
}
void cmd_get_mode(SerialCommands *sender)
{
  sender->GetSerial()->println(settings.mode12 ? 12 : 24);
}

void cmd_set_mode(SerialCommands *sender)
{
  char *mode_str = sender->Next();
  if (mode_str == NULL)
  {
    sender->GetSerial()->println("ERROR NO_MODE");
    return;
  }

  int mode = atoi(mode_str);
  if (mode != 12 && mode != 24)
  {
    sender->GetSerial()->printf("ERROR MODE OUT OF RANGE {%d}: %s", mode, mode_str);
    return;
  }

  settings.mode12 = (mode == 12);
  settings_save();
  sender->GetSerial()->println("OK");
}

void cmd_get_alarm(SerialCommands *sender)
{
  // "<hh> <mm> <armed>"
  sender->GetSerial()->printf("%02d %02d %d\r\n",
                              settings.alarmHour,
                              settings.alarmMinute,
                              settings.alarmArmed ? 1 : 0);
}

void cmd_set_alarm(SerialCommands *sender)
{
  char *hour_str = sender->Next();
  if (hour_str == NULL)
  {
    sender->GetSerial()->println("ERROR NO_HOUR");
    return;
  }

  char *minute_str = sender->Next();
  if (minute_str == NULL)
  {
    sender->GetSerial()->println("ERROR NO_MINUTE");
    return;
  }

  int hour = atoi(hour_str);
  if (hour < 0 || hour >= 24)
  {
    sender->GetSerial()->printf("ERROR HOUR OUT OF RANGE {%d}: %s", hour, hour_str);
    return;
  }

  int minute = atoi(minute_str);
  if (minute < 0 || minute >= 60)
  {
    sender->GetSerial()->printf("ERROR MINUTE OUT OF RANGE {%d}: %s", minute, minute_str);
    return;
  }

  settings.alarmHour = hour;
  settings.alarmMinute = minute;
  settings_save();
  sender->GetSerial()->println("OK");
}

void cmd_alarm_enable(SerialCommands *sender)
{
  char *enable_str = sender->Next();
  if (enable_str == NULL)
  {
    sender->GetSerial()->println("ERROR NO_STATE");
    return;
  }

  int enable = atoi(enable_str);
  if (enable != 0 && enable != 1)
  {
    sender->GetSerial()->printf("ERROR STATE OUT OF RANGE {%d}: %s", enable, enable_str);
    return;
  }

  settings.alarmArmed = (enable == 1);
  settings_save();

  // Disarming silences a firing alarm too. Without this the only way out of the
  // firing state is a button press, which leaves no way to stop it from a host.
  if (!settings.alarmArmed && stateMachine.getState() == State::FIRING)
  {
    stateMachine.execute(Action::ALARM_DISMISS);
  }

  sender->GetSerial()->println("OK");
}

void cmd_get_disp(SerialCommands *sender)
{
  // "<level> <duty>" -- the duty makes the active-low inversion checkable from a
  // host: a low level must read a low duty, not a high one.
  sender->GetSerial()->printf("%d %d\r\n",
                              settings.displayLevel + 1,
                              disp_gamma[effective_display_level()]);
}

void cmd_set_disp(SerialCommands *sender)
{
  char *level_str = sender->Next();
  if (level_str == NULL)
  {
    sender->GetSerial()->println("ERROR NO_LEVEL");
    return;
  }

  int level = atoi(level_str);
  if (level < 1 || level > DISP_LEVELS)
  {
    sender->GetSerial()->printf("ERROR LEVEL OUT OF RANGE {%d}: %s", level, level_str);
    return;
  }

  settings.displayLevel = level - 1;
  settings_save();
  sender->GetSerial()->println("OK");
}

