gcoonrod/stm32-shift-display/firmware/src/main.cpp
void cmd_get_backup(SerialCommands *sender)
{
  // "boot:<magic> <flags> <alarm> <bright>  now:<magic> <flags> <alarm> <bright>"
  // The boot values are what settings_load() saw; the now values are what the
  // registers hold at this moment.
  sender->GetSerial()->printf("boot:%04lX %04lX %04lX %04lX now:%04lX %04lX %04lX %04lX expect_magic:%04X\r\n",
                              (unsigned long)boot_magic_seen,
                              (unsigned long)boot_flags_seen,
                              (unsigned long)boot_alarm_seen,
                              (unsigned long)boot_bright_seen,
                              (unsigned long)getBackupRegister(BKP_MAGIC_REG),
                              (unsigned long)getBackupRegister(BKP_FLAGS_REG),
                              (unsigned long)getBackupRegister(BKP_ALARM_REG),
                              (unsigned long)getBackupRegister(BKP_BRIGHT_REG),
                              BKP_MAGIC_VALUE);
}

void cmd_get_leds(SerialCommands *sender)
{
  // "<top> <mid> <bot>" as duty values, 0-255. Lit means non-zero. Reporting
  // duty rather than a logical level keeps a breathing alarm observable from a
  // host, and digitalRead() is no longer meaningful here anyway: on a pin the
  // timer is driving it samples the live PWM waveform at an arbitrary phase.
  sender->GetSerial()->printf("%d %d %d\r\n",
                              led_duty[0], led_duty[1], led_duty[2]);
}

void cmd_get_bright(SerialCommands *sender)
{
  sender->GetSerial()->println(settings.indicatorLevel + 1);
}

void cmd_set_bright(SerialCommands *sender)
{
  char *level_str = sender->Next();
  if (level_str == NULL)
  {
    sender->GetSerial()->println("ERROR NO_LEVEL");
    return;
  }

  int level = atoi(level_str);
  if (level < 1 || level > LED_LEVELS)
  {
    sender->GetSerial()->printf("ERROR LEVEL OUT OF RANGE {%d}: %s", level, level_str);
    return;
  }

  settings.indicatorLevel = level - 1;
  settings_save();
  sender->GetSerial()->println("OK");
}
